#include "vein.h"

/********************************************************************
*                      功能函数
*功能描述： 拷贝字符串
*输入参数： 字符串
*返回值：地址或NULL
*其他说明：无
*修改日期       版本      修改人        修改内容
*---------------------------------------------------------------------
*2022.12.17     1.0        刘杨
**********************************************************************/
char *strdup(const char* str)
{
    char* strat = (char*)str;
    int len = 0;
    while (*str++ != '\0')
     len++;
    char* ret = (char*)VEIN_MALLOC(len + 1);
    while ((*ret++ = *strat++) != '\0'){}
    return ret - (len + 1);
}
